USE euros;
INSERT INTO `holiday_templates` (`year`,`holiday_date`,`name`,`note`,`created_at`,`updated_at`) VALUES
 ('2023','2023-01-01','元日',NULL,NOW(),NOW()),
 ('2023','2023-01-02','休日','※祝日法第3条第2項による休日',NOW(),NOW()),
 ('2023','2023-01-09','成人の日',NULL,NOW(),NOW()),
 ('2023','2023-02-11','建国記念の日',NULL,NOW(),NOW()),
 ('2023','2023-02-23','天皇誕生日',NULL,NOW(),NOW()),
 ('2023','2023-03-21','春分の日',NULL,NOW(),NOW()),
 ('2023','2023-04-29','昭和の日',NULL,NOW(),NOW()),
 ('2023','2023-05-03','憲法記念日',NULL,NOW(),NOW()),
 ('2023','2023-05-04','みどりの日',NULL,NOW(),NOW()),
 ('2023','2023-05-05','こどもの日',NULL,NOW(),NOW()),
 ('2023','2023-07-17','海の日',NULL,NOW(),NOW()),
 ('2023','2023-08-11','山の日',NULL,NOW(),NOW()),
 ('2023','2023-09-18','敬老の日',NULL,NOW(),NOW()),
 ('2023','2023-09-23','秋分の日',NULL,NOW(),NOW()),
 ('2023','2023-10-09','スポーツの日',NULL,NOW(),NOW()),
 ('2023','2023-11-03','文化の日',NULL,NOW(),NOW()),
 ('2023','2023-11-23','勤労感謝の日',NULL,NOW(),NOW());
